Autodesk.Revit.DB.TextElementBackground
An enumerated type listing all the background mode for the built-in parameter TEXT_BACKGROUND.

Autodesk.Revit.DB.TextElementBackground.TBGR_TRANSPARENT
The TextElement object is transparent.

Autodesk.Revit.DB.TextElementBackground.TBGR_OPAQUE
The TextElement object is opaque.